Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# encryption_random_bits_data
source: Random %1$lld-bits of data
ar: بيانات عشوائية بحجم %1$lld بت
de: Zufällige %1$lld Bits von Daten
es: %1$lld-bits aleatorios de datos
fr: %1$lld bits de données aléatoires
hu: Véletlenszerű %1$lld bites adat
it: %1$lld-bits di dati casuali
ja: ランダムな%1$lldビットのデータ
ko: 무작위 데이터 %1$lld비트
pt_br: %1$lld- bits de dados aleatórios
pt_pt: %1$lld- bits de dados aleatórios
ru: Случайные %1$lld-битные данные
uk: Випадкові %1$lld-бітні дані
zh_hans: 随机的 %1$lld 位数据

# encryption_salt
source: Salt
ar: ملح
es: Sal
fr: Sel
hu: Só
ja: ソルト
ko: 솔트
pt_pt: Segredo
ru: Соль
uk: Сіль
zh_hans: 盐

source: Equivalent domains
ar: نطاقات معادلة
de: Äquivalente Domänen
es: Dominios equivalentes
fr: Domaines équivalents
hu: Azonos domainek
it: Domini equivalenti
ja: 等価ドメイン
pt_br: Domínios equivalentes
pt_pt: Domínios equivalentes
ru: Эквивалентные домены
uk: Еквівалентні домени
zh_hans: 等效域名

# equivalent_domains_empty_label
source: No equivalent domains
ar: لا توجد نطاقات معادلة
de: Keine gleichwertigen Domänen
es: No hay dominios equivalentes
fr: Aucun domaine équivalent
hu: Nem azonos domainek
it: Nessun dominio equivalente
ja: 等価ドメインがありません
pt_br: Nenhum domínio equivalente
pt_pt: Nenhum domínio equivalente
ru: Нет эквивалентных доменов
uk: Немає еквівалентних доменів
zh_hans: 暂无等效域名

# error_credential_calling_app_not_privileged
source: The calling app is not on the privileged list and can not request authentication on behalf of the other apps.
ar: التطبيق المتصل ليس في قائمة التطبيقات ذات الامتيازات ولا يمكنه طلب المصادقة نيابة عن التطبيقات الأخرى.
de: Die aufrufende App steht nicht auf der Liste der privilegierten Apps und kann keine Authentifizierung im Namen anderer Apps anfordern.
es: La aplicación que llama no está en la lista de privilegios y no puede solicitar autenticación en nombre de las otras aplicaciones.
fr: L'application appelante ne figure pas sur la liste privilégiée et ne peut pas demander d'authentification au nom des autres applications.
hu: A hívó alkalmazás nem szerepel a kiváltságos listán, és nem kérhet hitelesítést a többi alkalmazás nevében.
it: L'app chiamante non è nell'elenco delle app con privilegi e non può richiedere l'autenticazione per conto di altre app.
ja: 呼び出し元のアプリは特権アプリケーションのリストに含まれておらず、他のアプリの代わりに認証をリクエストすることはできません。
ko: 호출한 앱이 권한 목록에 없어 다른 앱을 대신해 인증을 요청할 수 없습니다.
pt_br: O aplicativo de chamada não está na lista de privilégios e não pode solicitar autenticação em nome de outros aplicativos.
pt_pt: A aplicação que está a fazer a chamada não está na lista de aplicações privilegiadas e não pode solicitar autenticação em nome das outras aplicações.
ru: Приложение, выполняющее запрос, не входит в список доверенных и не может запрашивать аутентификацию от имени других приложений.
uk: Застосунок, що надіслав запит, відсутній у списку привілейованих і не може запитувати автентифікацію від імені інших застосунків.
zh_hans: 发起调用的应用程序不在特权列表中，因此不能代表其他应用程序请求身份验证。

# error_credential_calling_app_not_privileged_add_as_privileged_app_note
source: Trusting an app allows it to request credentials for any service. A malicious app could use this to try to steal your credentials.
ar: الثقة في تطبيق ما تسمح له بطلب بيانات الاعتماد لأي خدمة. قد يستخدم تطبيق خبيث هذا لمحاولة سرقة بيانات الاعتماد الخاصة بك.
de: Wenn Sie einer App vertrauen, kann diese Anmeldedaten für einen beliebigen Dienst anfordern. Eine böswillige App könnte dies nutzen, um zu versuchen, Ihre Anmeldedaten zu stehlen.
es: Confiar en una aplicación le permite solicitar credenciales para cualquier servicio. Una aplicación maliciosa podría usarla para intentar robar sus credenciales.
fr: Autoriser une application lui permet de demander des identifiants pour n'importe quel service. Une application malveillante pourrait utiliser cette fonctionnalité pour tenter de voler vos identifiants.
hu: Egy alkalmazás megbízhatónak jelölése lehetővé teszi számára, hogy bármely szolgáltatáshoz hitelesítő adatokat kérjen. Egy rosszindulatú alkalmazás ezt felhasználhatja a hitelesítő adatok ellopására.
it: Se consideri affidabile un'app questa potrà richiedere le credenziali per qualsiasi servizio. Un'app dannosa potrebbe sfruttare questa funzionalità per cercare di rubare le tue credenziali.
ja: アプリを信頼すると、任意のサービスに対する認証情報をリクエストできるようになります。悪意のあるアプリがこれを悪用して認証情報を盗む可能性があります。
ko: 앱을 신뢰하면 모든 서비스에 대한 인증 정보를 요청할 수 있습니다. 악성 앱이 이를 악용하여 사용자의 인증 정보를 탈취할 위험이 있습니다.
pt_br: Confiar em um aplicativo permite solicitar credenciais para qualquer serviço. Um aplicativo malicioso pode usar isso para tentar roubar suas credenciais.
pt_pt: Confiar numa aplicação permite que esta solicite credenciais para qualquer serviço. Uma aplicação maliciosa pode usar isso para tentar roubar as suas credenciais.
ru: Доверие к приложению позволяет ему запрашивать учетные данные для любых сервисов. Вредоносное приложение может воспользоваться этим, чтобы похитить ваши учетные данные.
uk: Дозволяє йому запитувати облікові дані для будь-якого сервісу. Зловмисний застосунок може використати це для викрадення ваших облікових даних.
zh_hans: 信任某个应用就意味着它有权请求任何服务的凭据。恶意应用可能会利用这一点来窃取您的凭据。

# error_credential_calling_app_not_privileged_add_as_privileged_app_title
source: Grant the privilege and continue
ar: منح الامتياز والمتابعة
de: Berechtigung erteilen und fortfahren
es: Otorgar el privilegio y continuar
fr: Accorder le privilège et continuer
hu: Kiváltság megadása és folytatás
it: Concedi il privilegio e continua
ja: 特権を付与して続行する
ko: 권한을 부여하고 계속하기
pt_br: Conceda o privilégio e continue
pt_pt: Conceda o privilégio e continue
ru: Предоставить разрешение и продолжить
uk: Надати привілей і продовжити
zh_hans: 授予特权并继续

# error_failed_create_passkey
source: Failed to create a passkey
ar: فشل في إنشاء مفتاح مرور
de: Fehler beim Erstellen eines Passkey
es: Error al crear una llave de acceso
fr: Impossible de créer une clé d'accès
hu: Nem sikerült létrehozni hozzáférési kulcsot
it: Impossibile creare passkey
ja: パスキーの生成に失敗しました
ko: 패스키를 생성하지 못했습니다.
pt_br: Falha ao criar uma chave de acesso
pt_pt: Falha ao criar chave de acesso
ru: Не удалось создать passkey
uk: Не вдалося створити ключ доступу
zh_hans: 创建通行密钥失败

# error_failed_create_password
source: Failed to create a password
ar: فشل إنشاء كلمة مرور
de: Passwort konnte nicht erstellt werden
es: Error al crear una contraseña
fr: Échec de la création d'un mot de passe
hu: Nem sikerült létrehozni a jelszót
it: Impossibile creare una password
ko: 비밀번호를 만들지 못했습니다.
pt_br: Falha ao criar uma senha
pt_pt: Falha ao criar palavra-passe
ru: Ошибка при создании пароля
uk: Не вдалося створити пароль
zh_hans: 创建密码失败

# error_failed_decrypt_biometric_key
source: Failed to decrypt the biometric key
ar: فشل فك تشفير المفتاح البيومتري
de: Fehler beim Entschlüsseln des biometrischen Schlüssels
es: Error al descifrar la clave biométrica
fr: Impossible de déchiffrer la clé biométrique
hu: Nem sikerült visszafejteni a biometrikus kulcsot
it: Impossibile decrittografare la chiave biometrica
ja: 生体認証キーの復号化に失敗しました
ko: 생체 정보 키를 복호화하지 못했습니다.
pt_br: Falha ao descriptografar a chave biométrica
pt_pt: Falha ao desencriptar a chave biométrica
ru: Не удалось расшифровать биометрический ключ
uk: Не вдалося розшифрувати біометричний ключ
zh_hans: 解密生物识别密钥失败

# error_failed_encrypt_biometric_key
source: Failed to encrypt the biometric key
ar: فشل تشفير المفتاح البيومتري
de: Fehler beim Verschlüsseln des biometrischen Schlüssels
es: Error al cifrar la clave biométrica
fr: Impossible de chiffrer la clé biométrique
hu: Nem sikerült titkosítani a biometrikus kulcsot
it: Impossibile crittografare la chiave biometrica
ja: 生体認証キーの暗号化に失敗しました
ko: 생체 정보 키를 암호화하지 못했습니다.
pt_br: Falha ao criptografar a chave biométrica
pt_pt: Falha ao encriptar a chave biométrica
ru: Не удалось зашифровать биометрический ключ
uk: Не вдалося зашифрувати біометричний ключ
zh_hans: 加密生物识别密钥失败

# error_failed_file_already_exists
source: Failed to create a file. Replacing existing file is not allowed
ar: فشل إنشاء ملف. استبدال ملف موجود غير مسموح به
de: Datei konnte nicht erstellt werden. Das Ersetzen der existierenden Datei ist nicht erlaubt
es: Error al crear un archivo. No se permite reemplazar el archivo existente
fr: Échec de la création d'un fichier. Le remplacement d'un fichier existant n'est pas autorisé
hu: Nem sikerült létrehozni a fájlt. A meglévő fájl cseréje nem engedélyezett
it: Impossibile creare il file. La sostituzione del file esistente non è consentita
ko: 파일을 만들지 못했습니다. 이미 존재하는 파일은 교체할 수 없습니다.
pt_br: Falha ao criar o arquivo. Substituição do arquivo existente não é permitido
pt_pt: Falha ao criar o ficheiro. Não é permitido substituir um ficheiro existente
ru: Ошибка при создании файла. Заменить существующий файл нельзя
uk: Не вдалося створити файл. Заміна наявного файлу заборонена
zh_hans: 无法创建文件。不允许替换现有文件

# error_failed_format_placeholder
source: Failed to format the placeholder
ar: فشل تنسيق العنصر النائب
de: Platzhalter konnte nicht formatiert werden
es: Error al formatear el marcador de posición
fr: Impossible de formater l'emplacement
hu: Nem sikerült formázni a helyettesítőt
it: Impossibile formattare il segnaposto
ja: プレースホルダーのフォーマットに失敗しました
ko: 플레이스홀더를 만들지 못했습니다.
pt_br: Falha ao formatar o espaço reservado
pt_pt: Falha ao formatar o espaço reservado
ru: Не удалось форматировать поле
uk: Не вдалося відформатувати поле
zh_hans: 格式化占位符失败

# error_failed_generate_kdf_hash_oom
source: Failed to create a key, not enough memory. Please check your KDF server settings.
ar: فشل في إنشاء مفتاح، لا توجد ذاكرة كافية. يرجى التحقق من إعدادات خادم KDF الخاص بك.
de: Fehler beim Erstellen eines Schlüssels, nicht genügend Speicher. Bitte überprüfe die KDF-Server-Einstellungen.
es: Error al crear una clave, no hay suficiente memoria. Por favor, compruebe la configuración del servidor de KDF.
fr: Impossible de créer une clé : il n'y a pas assez de mémoire, veuillez vérifier les paramètres de votre serveur KDF.
hu: Nem sikerült létrehozni a kulcsot, nincs elég memória. Kérjük, ellenőrizze a KDF szerver beállításait.
it: Creazione di una chiave non riuscita, memoria insufficiente. Controlla le impostazioni del server KDF.
ja: メモリが不足しているためキーの作成に失敗しました。KDF サーバーの設定を確認してください。
ko: 메모리가 부족하여 키를 생성하지 못했습니다. KDF 서버 설정을 확인해 보세요.
pt_br: Falha ao criar uma chave, memória insuficiente. Por favor, verifique as configurações do servidor KDF.
pt_pt: Falha ao criar chave, sem memória. Por favor, verifique as configurações do seu servidor KDF.
ru: Не удалось создать ключ, недостаточно памяти. Проверьте настройки KDF сервера.
uk: Не вдалося створити ключ, не вистачає пам'яті. Перевірте KDF налаштування сервера.
zh_hans: 创建密钥失败，内存不足。请检查您的 KDF 服务器设置。

# error_failed_generate_otp_code
source: Failed to generate OTP code
ar: فشل في إنشاء رمز OTP
de: Fehler beim Generieren des Einmalpassworts
es: Error al generar el código OTP
fr: Impossible de générer le code de mot de passe à usage unique (OTP)
hu: Nem sikerült legenerálni az OTP-kódot
it: Impossibile generare il codice OTP
ja: OTP コードの生成に失敗しました
ko: OTP 코드를 생성하지 못했습니다.
pt_br: Falha ao gerar código OTP
pt_pt: Falha ao gerar código OTP
ru: Не удалось сгенерировать OTP код
uk: Помилка генерації одноразового коду
zh_hans: 生成一次性验证码失败

# error_failed_gpg_agent_start
source: Failed to start the GPG agent
ar: فشل تشغيل وكيل GPG
de: GPG-Agent konnte nicht gestartet werden
es: Error al iniciar el agente GPG
fr: Échec du démarrage de l'agent GPG
it: Impossibile avviare l'agente GPG
ja: GPGエージェントの起動に失敗しました
ko: GPG 에이전트를 시작하지 못했습니다.
pt_br: Falha ao iniciar o agente GPG
pt_pt: Falha ao iniciar o agente GPG
ru: Не удалось запустить GPG-агент
uk: Не вдалося запустити GPG-агент
zh_hans: 启动 GPG 代理失败

# error_failed_open_app_for
source: No installed app can handle this request
ar: لا يوجد تطبيق مثبت يمكنه التعامل مع هذا الطلب
de: Keine installierte App kann diese Anfrage bearbeiten
es: Ninguna aplicación instalada puede manejar esta solicitud
fr: Aucune application installée ne peut gérer cette requête
hu: Egyetlen telepített alkalmazás sem tudja kezelni ezt a kérést
it: Nessun'app installata può gestire questa richiesta
ja: インストールされているアプリはこのリクエストを処理できません
ko: 이 요청을 처리할 수 있는 앱이 없습니다.
pt_br: Nenhum aplicativo instalado pode realizar esta requisição
pt_pt: Nenhuma aplicação instalado pode realizar esta requisição
ru: Ни одно установленное приложение не может обработать этот запрос
uk: Немає встановленого застосунку, що може обробити цей запит
zh_hans: 没有已安装的应用可以处理此请求

# error_failed_open_uri
source: Failed to open a URI
ar: فشل في فتح URI
de: Fehler beim Öffnen einer URI
es: Error al abrir una URI
fr: Échec de l'ouverture de l'URL
hu: Nem sikerült megnyitni az URI-t
it: Impossibile aprire l'URI
ja: URI が開けませんでした
ko: URI를 열지 못했습니다.
pt_br: Falhou em abrir a URI
pt_pt: Falha ao abrir URI
ru: Не удалось открыть URI
uk: Не вдалося відкрити посилання
zh_hans: 无法打开 URI

# error_failed_power_lock_start
source: Could not enable locking when the screen turns off or the device sleeps. Restart Keyguard to try again.
ar: تعذر تمكين القفل عند إيقاف تشغيل الشاشة أو نوم الجهاز. أعد تشغيل Keyguard لإعادة المحاولة.
fr: Impossible d'activer le verrouillage lorsque l'écran s'éteint ou que l'appareil se met en veille. Relancez Keyguard pour réessayer.
pt_br: Não foi possível ativar o bloqueio quando a tela é desligada ou o dispositivo entra em suspensão. Reinicie o Keyguard para tentar novamente.
pt_pt: Não foi possível ativar o bloqueio quando o ecrã desliga ou o dispositivo entra em modo de repouso. Reinicie o Keyguard para tentar novamente.

# error_failed_ssh_agent_start
source: Failed to start the SSH agent
ar: فشل بدء وكيل SSH
de: SSH-Agent konnte nicht gestartet werden
es: Error al iniciar el agente SSH
fr: Échec du démarrage de l'agent SSH
hu: Nem sikerült elindítani az SSH ügynököt
it: Impossibile avviare l'agente SSH
ja: SSHエージェントの起動に失敗しました
ko: SSH 에이전트를 시작하지 못했습니다.
pt_br: Falha ao iniciar o agente SSH
pt_pt: Falha ao iniciar o agente SSH
ru: Не удалось запустить SSH-агент
uk: Не вдалося запустити SSH агент
zh_hans: 启动 SSH 代理失败

# error_failed_unknown
source: Something went wrong
ar: حدث خطأ ما
de: Etwas ist schiefgelaufen
es: Algo salió mal
fr: Une erreur est survenue
hu: Valami hiba történt
it: Qualcosa è andato storto
ja: 何らかの問題が発生しました
ko: 알 수 없는 오류가 발생했습니다.
pt_br: Algo deu errado
pt_pt: Algo correu mal
ru: Произошла ошибка
uk: Сталася помилка
zh_hans: 出错了

# error_failed_use_passkey
source: Failed to authorize a request
ar: فشل في اعتماد الطلب
de: Anfrage konnte nicht autorisiert werden
es: Error al autorizar una solicitud
fr: Impossible d'autoriser une demande
hu: Nem sikerült hitelesíteni a kérelmet
it: Impossibile autorizzare la richiesta
ja: リクエストを承認できませんでした
ko: 요청을 승인하지 못했습니다.
pt_br: Falha ao autorizar um pedido
pt_pt: Falha ao autorizar um pedido
ru: Ошибка авторизации запроса
uk: Не вдалося авторизувати запит
zh_hans: 授权请求失败

# error_failed_use_password
source: Failed to authorize a request
ar: فشلت مصادقة الطلب
de: Anfrage konnte nicht autorisiert werden
es: Error al autorizar una solicitud
fr: Échec de l'autorisation d'une demande
hu: Nem sikerült hitelesíteni a kérést
it: Impossibile autorizzare una richiesta
ko: 요청을 인증하지 못했습니다.
pt_br: Falha ao autorizar uma solicitação
pt_pt: Não foi possível autorizar um pedido
ru: Ошибка при авторизации запроса
uk: Не вдалося авторизувати запит
zh_hans: 授权请求失败

# error_file_must_be_1_mb_or_smaller
source: File must be 1 MB or smaller
ar: يجب ألا يتجاوز حجم الملف 1 ميغابايت
de: Die Datei darf höchstens 1 MB groß sein
fr: Le fichier ne doit pas dépasser 10 Mo.
hu: A fájl mérete legfeljebb 1 MB lehet
pt_br: Arquivo deve ter 1 MB ou menos
pt_pt: O ficheiro deve ter 1 MB ou menos
uk: Розмір файлу має бути 1 Мб або менше
zh_hans: 文件大小必须小于等于 1 MB

# error_file_must_be_500_mb_or_smaller
source: File must be 500 MB or smaller
ar: يجب ألا يتجاوز حجم الملف 500 ميغابايت
de: Die Datei darf höchstens 500 MB groß sein
es: El archivo debe ser de 500 MB o más pequeño
fr: Le fichier ne doit pas dépasser 500 Mo.
hu: A fájl mérete legfeljebb 500 MB lehet
pt_br: Arquivo deve ter 500 MB ou menos
pt_pt: O ficheiro deve ter 500 MB ou menos
uk: Розмір файлу має бути 500 Мб або менше
zh_hans: 文件大小必须小于等于 500 MB

# error_file_must_be_n_or_smaller
source: File must be %1$@ or smaller
ar: يجب ألا يتجاوز حجم الملف %1$@
de: Die Datei darf höchstens %1$@ groß sein
fr: Le fichier ne doit pas dépasser %1$@.
pt_br: Arquivo deve ter %1$@ ou menor
pt_pt: O ficheiro deve ter %1$@ ou menos
uk: Розмір файлу має бути не більшим за %1$@
zh_hans: 文件大小必须小于等于 %1$@

# error_incorrect_password
source: Incorrect password
ar: كلمة مرور غير صحيحة
de: Falsches Passwort
es: Contraseña incorrecta
fr: Mot de passe incorrect
hu: Helytelen jelszó
it: Password errata
ja: パスワードが間違っています
ko: 잘못된 비밀번호입니다.
pt_br: Senha incorreta
pt_pt: Palavra-passe incorreta
ru: Неверный пароль
uk: Невірний пароль
zh_hans: 密码错误

# error_invalid_card_number
source: Invalid card number
ar: رقم البطاقة غير صالح
de: Kartennummer ungültig
es: Número de tarjeta no válido
fr: Numéro de carte invalide
hu: Érvénytelen kártyaszám
it: Numero carta non valido
ja: 無効なカード番号
ko: 잘못된 카드 번호입니다.
pt_br: Número de cartão inválido
pt_pt: Número de cartão inválido
ru: Недействительный номер карты
uk: Недійсний номер картки
zh_hans: 卡号无效

# error_invalid_domain
source: Invalid domain
ar: المجال غير صالح
de: Ungültige Domain
es: Dominio no válido
fr: Domaine invalide
hu: Érvénytelen domain név
it: Dominio non valido
ja: 無効なドメイン
ko: 잘못된 도메인입니다.
pt_br: Domínio inválido
pt_pt: Domínio inválido
ru: Недопустимый домен
uk: Невірний домен
zh_hans: 无效域名

# error_invalid_email
source: Invalid email
ar: بريد إلكتروني غير صالح
de: Ungültige E-Mail
es: Correo electrónico no válido
fr: Email invalide
hu: Érvénytelen e-mail cím
it: Indirizzo email non valido
ja: 無効なメールアドレス
ko: 잘못된 이메일입니다.
pt_br: E-mail inválido
pt_pt: E-mail inválido
ru: Недопустимый e-mail
uk: Невірна адреса ел. пошти
zh_hans: 电子邮件无效

# error_invalid_key
source: Invalid key
ar: مفتاح غير صالح
de: Ungültiger Schlüssel
es: Clave no válida
fr: Clé invalide
hu: Érvénytelen kulcs
pt_br: Chave inválida
pt_pt: Chave inválida
uk: Некоректний ключ
zh_hans: 无效的密钥

# error_invalid_regex
source: Invalid regular expression
ar: تعبير نمطي غير صالح
fr: Expression régulière invalide
pt_br: Expressão regular inválida
pt_pt: Expressão regular inválida

# error_invalid_uri
source: Invalid URI
ar: عنوان URL غير صالح
de: Ungültige URI
es: URI no válida
fr: URI invalide
hu: Érvénytelen URI
it: URI non valido
ja: 無効な URI
ko: 잘못된 URI입니다.
pt_br: URI inválido
pt_pt: URI inválido
ru: Неверный URI
uk: Некоректний URI
zh_hans: URI 无效

# error_invalid_url
source: Invalid URL
ar: عنوان URL غير صالح
de: Ungültige URL
es: URL no válida
fr: URL invalide
hu: Érvénytelen URL
it: URL non valido
ja: 無効な URL
ko: 잘못된 URL입니다.
pt_br: URL inválida
pt_pt: Endereço inválido
ru: Недопустимый URL-адрес
uk: Некоректна URL-адреса
zh_hans: URL无效

# error_must_be_custom_domain
source: Must be custom domain
ar: يجب أن يكون المجال المخصص
de: Muss eine eigene Domain sein
es: Debe ser un dominio personalizado
fr: Doit être un domaine personnalisé
hu: Egyéni domainnek kell lennie
it: Deve essere un dominio personalizzato
ja: カスタムドメインである必要があります
ko: 사용자 지정 도메인을 입력해야 합니다.
pt_br: Deve ser um domínio personalizado
pt_pt: Deve ser um domínio personalizado
ru: Должен быть собственный домен
uk: Має бути вашим доменом
zh_hans: 必须为第三方域名

# error_must_be_less_than_days
source: Must be less than %1$lld days from now
ar: يجب أن يكون أقل من %1$lld يومًا من الآن
de: Muss kleiner als %1$lld Tage von der aktuellen Zeit sein
es: Debe ser menor de %1$lld días a partir de la hora actual
fr: Doit être inférieur à %1$lld jours à partir du moment actuel
hu: Kevesebbnek kell lennie, mint %1$lld nap a jelenlegi időtől számítva
it: Deve essere a meno di %1$lld giorni da oggi
ja: 今から %1$lld 日未満である必要があります
ko: 현재 시간으로부터 %1$lld일 이내여야 합니다.
pt_br: Deve ser menos que %1$lld dias do tempo atual
pt_pt: Deve ser menor que %1$lld dias a partir da data atual
ru: Должно быть меньше %1$lld дней с текущего времени
uk: Має бути менше ніж %1$lld днів з поточного моменту
zh_hans: 从当前时间起必须小于 %1$lld 天

# error_must_be_number
source: Must be a number
ar: يجب أن يكون رقما
de: Muss eine Zahl sein
es: Debe ser un número
fr: Doit être un nombre
hu: Számot kell megadnia
it: Deve essere un numero
ja: 数字でなければなりません
ko: 숫자만 가능합니다.
pt_br: Deve ser um número
pt_pt: Deve ser um número
ru: Должно быть числом
uk: Має бути числом
zh_hans: 必须为数字

# error_must_contain_only_us_ascii_chars
source: Must contain only US-ASCII characters
ar: يجب أن يحتوي على أحرف US-ASCII فقط
de: Darf nur US-ASCII-Zeichen enthalten
es: Debe contener solo caracteres US-ASCII
fr: Doit contenir uniquement des caractères US-ASCII
hu: Csak US-ASCII karaktereket tartalmazhat
it: Deve contenere solo caratteri US-ASCII
ja: US-ASCII 文字のみである必要があります
ko: US-ASCII 문자만 사용할 수 있습니다.
pt_br: Deve conter apenas caracteres US-ASCII
pt_pt: Deve conter apenas caracteres US-ASCII
ru: Должен содержать только символы US-ASCII
uk: Має містити тільки US-ASCII символи
zh_hans: 必须只包含 US-ASCII 字符

# error_must_have_at_least_n_symbols
source: Must be at least %1$lld symbols long
ar: يجب أن لا يقل عن %1$lld رموز
de: Muss mindestens %1$lld Zeichen lang sein
es: Al menos debe tener %1$lld símbolos
fr: Doit d'au moins %1$lld caractères de long
hu: Legalább %1$lld szimbólum hosszúságúnak kell lennie
it: Deve avere almeno %1$lld simboli
ja: 少なくとも%1$lld文字以上である必要があります
ko: 최소 %1$lld글자 이상이어야 합니다.
pt_br: Deve ter no mínimo %1$lld símbolos
pt_pt: Mínimo %1$lld caracteres de comprimento
ru: Должно быть не менее %1$lld символов
uk: Має мати довжину в хоча б %1$lld символів
zh_hans: 长度须至少为 %1$lld 位字符

# error_must_have_exactly_n_symbols
source: Must be %1$lld symbols long
ar: يجب أن يتكون من %1$lld رموز بالضبط
de: Muss %1$lld Zeichen lang sein
es: Debe tener %1$lld símbolos
fr: Doit faire %1$lld caractères de long
hu: %1$lld szimbólum hosszúságúnak kell lennie
it: Deve avere %1$lld simboli
ja: %1$lld文字である必要があります
ko: 정확히 %1$lld글자여야 합니다.
pt_br: Deve ter %1$lld símbolos
pt_pt: Deve ter %1$lld símbolos de comprimento
ru: Должно быть %1$lld символов
uk: Має мати довжину в %1$lld символів
zh_hans: 长度必须为 %1$lld 位字符

# error_must_not_be_blank
source: Must not be blank
ar: يجب ألا تكون فارغة
de: Darf nicht leer sein
es: No debe estar en blanco
fr: Doit être renseigné
hu: Nem lehet üres
it: Non può essere vuoto
ja: 空にすることはできません
ko: 비워둘 수 없는 칸입니다.
pt_br: Não pode estar vazio
pt_pt: Não deve estar em branco
ru: Не должно быть пустым
uk: Не може бути порожнім
zh_hans: 不可为空

# error_must_not_be_empty
source: Must not be empty
ar: يجب ألا تكون فارغة
de: Darf nicht leer sein
es: No debe estar vacío
fr: Ne doit pas être vide
hu: Nem lehet üres
it: Non può essere vuoto
ja: 空にすることはできません
ko: 비워둘 수 없는 칸입니다.
pt_br: Não pode estar vazio
pt_pt: Não pode estar vazio
ru: Не должно быть пустым
uk: Не може бути порожнім
zh_hans: 不可为空

# error_not_found
source: Not found
ar: غير موجود
de: Nicht gefunden
es: No encontrado
fr: Non trouvé
hu: Nem található
it: Non trovato
ko: 찾을 수 없음
pt_br: Não encontrado
pt_pt: Não encontrado
ru: Не найдено
uk: Не знайдено
zh_hans: 未找到

# error_otp_key_is_invalid
source: One-time password's secret key is invalid
ar: المفتاح السري لكلمة المرور لمرة واحدة غير صالح
de: Der geheime Schlüssel des Einmalpassworts ist ungültig
es: Clave secreta de una sola vez no válida
fr: La clé secrète du mot de passe à usage unique est invalide.
hu: Az egyszeri jelszó titkos kulcsa érvénytelen
pt_br: Chave secreta da senha de uso único é inválida
pt_pt: A chave secreta da palavra-passe de utilização única é inválida
uk: Секретний ключ одноразового пароля недійсний
zh_hans: 一次性密码的密钥无效
